<div style="float:right; padding-top: 15px; padding-right: 15px">
    <div>
        <a href="https://whiteboxml.com">
            <img src="https://whiteboxml.com/static/img/logo/black_bg_white.svg" width="250">
        </a>
    </div>
</div>

# Introduction to Pandas

In [1]:
import numpy as np
import pandas as pd

## 1. Series

In [2]:
array = np.random.random(10)

array

array([0.8324967 , 0.47844624, 0.8312705 , 0.29463679, 0.56680162,
       0.70325806, 0.19039242, 0.10315596, 0.26989379, 0.05787779])

In [3]:
serie = pd.Series(array)

serie

0    0.832497
1    0.478446
2    0.831271
3    0.294637
4    0.566802
5    0.703258
6    0.190392
7    0.103156
8    0.269894
9    0.057878
dtype: float64

In [4]:
serie.index

RangeIndex(start=0, stop=10, step=1)

In [5]:
range(10)

range(0, 10)

In [6]:
list(serie.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [7]:
for i in serie.index:
    print(i)

0
1
2
3
4
5
6
7
8
9

In [8]:
serie.values

array([0.8324967 , 0.47844624, 0.8312705 , 0.29463679, 0.56680162,
       0.70325806, 0.19039242, 0.10315596, 0.26989379, 0.05787779])

In [9]:
type(serie.values)

numpy.ndarray

In [10]:
serie[3]

0.29463678505615254

## 2. DataFrames

In [11]:
matrix = np.random.random((10,5))

matrix

array([[0.36494898, 0.34561758, 0.98822581, 0.38914846, 0.90967767],
       [0.86441848, 0.437687  , 0.69917325, 0.79386522, 0.44103513],
       [0.32010658, 0.82970066, 0.70273537, 0.06482844, 0.33680083],
       [0.88239837, 0.59836974, 0.00203985, 0.64919414, 0.58284187],
       [0.63503177, 0.21497122, 0.77119694, 0.19270022, 0.55535019],
       [0.85586542, 0.61709688, 0.83258359, 0.03016845, 0.82068601],
       [0.51040167, 0.01112687, 0.54361067, 0.59453512, 0.29604817],
       [0.10594936, 0.22471285, 0.98950084, 0.08433382, 0.82712509],
       [0.4321129 , 0.76344429, 0.55623858, 0.98555364, 0.16222203],
       [0.03807592, 0.02403017, 0.40768748, 0.71001502, 0.88572253]])

In [12]:
colnames = ['col1', 'col2', 'col3', 'col4', 'col5']
df = pd.DataFrame(matrix, columns=colnames)
df

       col1      col2      col3      col4      col5
0  0.364949  0.345618  0.988226  0.389148  0.909678
1  0.864418  0.437687  0.699173  0.793865  0.441035
2  0.320107  0.829701  0.702735  0.064828  0.336801
3  0.882398  0.598370  0.002040  0.649194  0.582842
4  0.635032  0.214971  0.771197  0.192700  0.555350
5  0.855865  0.617097  0.832584  0.030168  0.820686
6  0.510402  0.011127  0.543611  0.594535  0.296048
7  0.105949  0.224713  0.989501  0.084334  0.827125
8  0.432113  0.763444  0.556239  0.985554  0.162222
9  0.038076  0.024030  0.407687  0.710015  0.885723

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
df.index.to_list()

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [16]:
df.columns

Index(['col1', 'col2', 'col3', 'col4', 'col5'], dtype='object')

In [17]:
df.values

array([[0.36494898, 0.34561758, 0.98822581, 0.38914846, 0.90967767],
       [0.86441848, 0.437687  , 0.69917325, 0.79386522, 0.44103513],
       [0.32010658, 0.82970066, 0.70273537, 0.06482844, 0.33680083],
       [0.88239837, 0.59836974, 0.00203985, 0.64919414, 0.58284187],
       [0.63503177, 0.21497122, 0.77119694, 0.19270022, 0.55535019],
       [0.85586542, 0.61709688, 0.83258359, 0.03016845, 0.82068601],
       [0.51040167, 0.01112687, 0.54361067, 0.59453512, 0.29604817],
       [0.10594936, 0.22471285, 0.98950084, 0.08433382, 0.82712509],
       [0.4321129 , 0.76344429, 0.55623858, 0.98555364, 0.16222203],
       [0.03807592, 0.02403017, 0.40768748, 0.71001502, 0.88572253]])

In [18]:
# this is a series
series = df['col1']

series

0    0.364949
1    0.864418
2    0.320107
3    0.882398
4    0.635032
5    0.855865
6    0.510402
7    0.105949
8    0.432113
9    0.038076
Name: col1, dtype: float64

In [19]:
# beware of the list now
df[['col1', 'col2', 'col3']]

       col1      col2      col3
0  0.364949  0.345618  0.988226
1  0.864418  0.437687  0.699173
2  0.320107  0.829701  0.702735
3  0.882398  0.598370  0.002040
4  0.635032  0.214971  0.771197
5  0.855865  0.617097  0.832584
6  0.510402  0.011127  0.543611
7  0.105949  0.224713  0.989501
8  0.432113  0.763444  0.556239
9  0.038076  0.024030  0.407687

In [20]:
# you will make this mistake
df['col1', 'col2', 'col3']

KeyError: ('col1', 'col2', 'col3')

In [21]:
cols = ['col1', 'col2', 'col3']

df[cols]

       col1      col2      col3
0  0.364949  0.345618  0.988226
1  0.864418  0.437687  0.699173
2  0.320107  0.829701  0.702735
3  0.882398  0.598370  0.002040
4  0.635032  0.214971  0.771197
5  0.855865  0.617097  0.832584
6  0.510402  0.011127  0.543611
7  0.105949  0.224713  0.989501
8  0.432113  0.763444  0.556239
9  0.038076  0.024030  0.407687

In [22]:
# this is a dataframe
df[['col1']]

       col1
0  0.364949
1  0.864418
2  0.320107
3  0.882398
4  0.635032
5  0.855865
6  0.510402
7  0.105949
8  0.432113
9  0.038076

In [23]:
# don't do this but it works
df[['col1']]['col1']

0    0.364949
1    0.864418
2    0.320107
3    0.882398
4    0.635032
5    0.855865
6    0.510402
7    0.105949
8    0.432113
9    0.038076
Name: col1, dtype: float64

In [24]:
df['col1']['col1']

KeyError: 'col1'

### 2.1 Build DataFrames from python objects

#### 2.1.1 From lists

In [25]:
lst = [208500, 181500, 223500, 140000, 250000, 143000, 307000, 200000, 129900, 118000]

price_df = pd.DataFrame(lst, columns=['SalePrice'])
price_df

   SalePrice
0     208500
1     181500
2     223500
3     140000
4     250000
5     143000
6     307000
7     200000
8     129900
9     118000

In [26]:
lst_lst = [[8450, 'CollgCr', 2003, 7, 208500],
           [9600, 'Veenker', 1976, 6, 181500],
           [11250, 'CollgCr', 2001, 7, 223500],
           [9550, 'Crawfor', 1915, 7, 140000],
           [14260, 'NoRidge', 2000, 8, 250000],
           [14115, 'Mitchel', 1993, 5, 143000],
           [10084, 'Somerst', 2004, 8, 307000],
           [10382, 'NWAmes', 1973, 7, 200000],
           [6120, 'OldTown', 1931, 7, 129900],
           [7420, 'BrkSide', 1939, 5, 118000]]

colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']
df = pd.DataFrame(lst_lst, columns=colnames)

df

   LotSize Neighborhood  YearBuilt  Quality  SalePrice
0     8450      CollgCr       2003        7     208500
1     9600      Veenker       1976        6     181500
2    11250      CollgCr       2001        7     223500
3     9550      Crawfor       1915        7     140000
4    14260      NoRidge       2000        8     250000
5    14115      Mitchel       1993        5     143000
6    10084      Somerst       2004        8     307000
7    10382       NWAmes       1973        7     200000
8     6120      OldTown       1931        7     129900
9     7420      BrkSide       1939        5     118000

In [27]:
df.columns

Index(['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice'], dtype='object')

In [28]:
df.columns.to_list()

['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice']

In [29]:
df.dtypes

LotSize          int64
Neighborhood    object
YearBuilt        int64
Quality          int64
SalePrice        int64
dtype: object

#### 2.1.2 From dicts

In [30]:
house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 123054],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [31]:
df = pd.DataFrame(house_dict)
df

,Baker House,Beazley House,Dominguez House,Hamilton House,James House,Martinez House,Roberts House,Smith House,Snyder House,Zuckerman House
0,7420,14115,14260,6120,11250,9600,9550,8450,10084,10382
1,BrkSide,Mitchel,NoRidge,OldTown,CollgCr,Veenker,Crawfor,CollgCr,Somerst,NWAmes
2,1939,1993,2000,1931,2001,1976,1915,2003,2004,1973
3,5,5,8,7,7,6,7,7,8,7
4,123054,143000,250000,129900,223500,181500,140000,208500,307000,200000

In [32]:
df.dtypes

Baker House        object
Beazley House      object
Dominguez House    object
Hamilton House     object
James House        object
Martinez House     object
Roberts House      object
Smith House        object
Snyder House       object
Zuckerman House    object
dtype: object

In [33]:
df.T

                     0        1     2  3       4
Baker House       7420  BrkSide  1939  5  123054
Beazley House    14115  Mitchel  1993  5  143000
Dominguez House  14260  NoRidge  2000  8  250000
Hamilton House    6120  OldTown  1931  7  129900
James House      11250  CollgCr  2001  7  223500
Martinez House    9600  Veenker  1976  6  181500
Roberts House     9550  Crawfor  1915  7  140000
Smith House       8450  CollgCr  2003  7  208500
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

In [34]:
df.T.index

Index(['Baker House', 'Beazley House', 'Dominguez House', 'Hamilton House',
       'James House', 'Martinez House', 'Roberts House', 'Smith House',
       'Snyder House', 'Zuckerman House'],
      dtype='object')

In [35]:
df.T.columns

RangeIndex(start=0, stop=5, step=1)

In [36]:
colnames

['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice']

In [37]:
df = df.T
df.columns = colnames

df

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    123054
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000
Hamilton House     6120      OldTown      1931       7    129900
James House       11250      CollgCr      2001       7    223500
Martinez House     9600      Veenker      1976       6    181500
Roberts House      9550      Crawfor      1915       7    140000
Smith House        8450      CollgCr      2003       7    208500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

In [38]:
house_dict

{'Baker House': [7420, 'BrkSide', 1939, 5, 123054],
 'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
 'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
 'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
 'James House': [11250, 'CollgCr', 2001, 7, 223500],
 'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
 'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
 'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
 'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
 'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [39]:
# orient='index' means take the dict keys as index (not as column names)
df = pd.DataFrame.from_dict(house_dict, orient='index')
df.columns = colnames

df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     123054
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

### 2.2 DataFrame operations

In [40]:
# Total price of all houses sold
print(df['SalePrice'].sum())

# Average lot size of houses sold
print(df['LotSize'].mean())

# The latest year a house in the data set was built
print(df['YearBuilt'].max())

# The eariliest year a house in the data set was built
print(df['YearBuilt'].min())

1906454
10123.1
2004
1915

In [41]:
df.sort_values(by='SalePrice', ascending=False)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Snyder House       10084      Somerst       2004        8     307000
Dominguez House    14260      NoRidge       2000        8     250000
James House        11250      CollgCr       2001        7     223500
Smith House         8450      CollgCr       2003        7     208500
Zuckerman House    10382       NWAmes       1973        7     200000
Martinez House      9600      Veenker       1976        6     181500
Beazley House      14115      Mitchel       1993        5     143000
Roberts House       9550      Crawfor       1915        7     140000
Hamilton House      6120      OldTown       1931        7     129900
Baker House         7420      BrkSide       1939        5     123054

In [42]:
df.sort_values(by=['Quality', 'SalePrice'], ascending=False)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Snyder House       10084      Somerst       2004        8     307000
Dominguez House    14260      NoRidge       2000        8     250000
James House        11250      CollgCr       2001        7     223500
Smith House         8450      CollgCr       2003        7     208500
Zuckerman House    10382       NWAmes       1973        7     200000
Roberts House       9550      Crawfor       1915        7     140000
Hamilton House      6120      OldTown       1931        7     129900
Martinez House      9600      Veenker       1976        6     181500
Beazley House      14115      Mitchel       1993        5     143000
Baker House         7420      BrkSide       1939        5     123054

In [43]:
df['LotSize'].sort_values()

Hamilton House      6120
Baker House         7420
Smith House         8450
Roberts House       9550
Martinez House      9600
Snyder House       10084
Zuckerman House    10382
James House        11250
Beazley House      14115
Dominguez House    14260
Name: LotSize, dtype: int64

In [44]:
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     123054
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [45]:
# row id, column id
df.loc['Beazley House', 'Neighborhood']

'Mitchel'

In [46]:
# row index, column index
df.iloc[1, 1]

'Mitchel'

In [47]:
df.loc['Beazley House']

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [48]:
df.iloc[1]

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [49]:
df['LotSize']

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [50]:
df.loc[:, 'LotSize']

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [51]:
df.iloc[:, 0]

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [52]:
# to access a certain column use df[col] instead of loc or iloc

In [53]:
# how to select only certain rows

In [54]:
# first 5 rows
df.head()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     123054
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500

In [55]:
# last 5 rows
df.tail()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [56]:
# random row
df.sample()

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Roberts House     9550      Crawfor       1915        7     140000

In [57]:
# certain rows
df.loc[['Roberts House', 'Baker House']]

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Roberts House     9550      Crawfor       1915        7     140000
Baker House       7420      BrkSide       1939        5     123054

In [58]:
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     123054
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [59]:
df.shape

(10, 5)

In [60]:
len(df)

10

In [61]:
df.size

50

In [62]:
df['new_col'] = np.random.random(10)

In [63]:
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice   new_col
Baker House         7420      BrkSide       1939        5     123054  0.953640
Beazley House      14115      Mitchel       1993        5     143000  0.773553
Dominguez House    14260      NoRidge       2000        8     250000  0.896575
Hamilton House      6120      OldTown       1931        7     129900  0.109616
James House        11250      CollgCr       2001        7     223500  0.633443
Martinez House      9600      Veenker       1976        6     181500  0.532502
Roberts House       9550      Crawfor       1915        7     140000  0.361056
Smith House         8450      CollgCr       2003        7     208500  0.271036
Snyder House       10084      Somerst       2004        8     307000  0.786468
Zuckerman House    10382       NWAmes       1973        7     200000  0.564434

In [64]:
df['new_again'] = df['Quality'] * df['SalePrice']

df

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again
Baker House,7420,BrkSide,1939,5,123054,0.953640,615270
Beazley House,14115,Mitchel,1993,5,143000,0.773553,715000
Dominguez House,14260,NoRidge,2000,8,250000,0.896575,2000000
Hamilton House,6120,OldTown,1931,7,129900,0.109616,909300
James House,11250,CollgCr,2001,7,223500,0.633443,1564500
Martinez House,9600,Veenker,1976,6,181500,0.532502,1089000
Roberts House,9550,Crawfor,1915,7,140000,0.361056,980000
Smith House,8450,CollgCr,2003,7,208500,0.271036,1459500
Snyder House,10084,Somerst,2004,8,307000,0.786468,2456000
Zuckerman House,10382,NWAmes,1973,7,200000,0.564434,1400000

## 3. Bonus

In [ ]:
df

In [ ]:
serie = df['LotSize']

serie

### 3.1 filter

In [ ]:
# series (watch the index)
lotsize_filter = serie > 10000

serie[lotsize_filter]

In [ ]:
df

In [ ]:
# dataframe
lotsize_filter = df['LotSize'] > 10000
quality_filter = df['Quality'] > 7

display(df[lotsize_filter & quality_filter])
display(df[lotsize_filter | quality_filter])
display(df[~(lotsize_filter & quality_filter)])

# if equivalences:
# and -> &
# or -> |
# not -> ~

### 3.2 map

In [ ]:
serie

In [ ]:
serie.apply(lambda x: x * 2)

In [ ]:
df[['LotSize', 'Quality']].apply(lambda x: x * 2)

In [ ]:
df.apply(lambda x: x * 2)

In [ ]:
df['LotSize'] * 2

In [ ]:
series_to_add = df['LotSize']

series_to_add

In [ ]:
# I'm creating a new column
df['my_new_column'] = series_to_add.apply(lambda x: x ** 2)

In [ ]:
df.head()

In [ ]:
df.columns

In [ ]:
df = df[['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'my_new_column', 'SalePrice']]

df

In [ ]:
df.append(df.iloc[1])

<div style="padding-top: 25px; float: right">
    <div>    
        <i>&nbsp;&nbsp;© Copyright by</i>
    </div>
    <div>
        <a href="https://whiteboxml.com">
            <img src="https://whiteboxml.com/static/img/logo/black_bg_white.svg" width="125">
        </a>
    </div>
</div>